<旁白> 有趣的西游记故事

<旁白> 话说唐僧师徒离开妖魔山洞之后，夜住晓行，一日上了一座险峻高山。日值功曹立在云端，提醒悟空说

<功曹> “大圣，前方山上有两个魔头，他们神通广大，变化多端。你千万仔细，保你师父。”

<旁白> 悟空听了，暗想

<悟空> 要是把功曹的话告诉师父，师父肯定会哭；要是不说实话，又怕他被妖怪捞去，不如让八戒先出头与妖怪打一仗看，只怕八戒躲懒不肯出头。

<旁白> 悟空想了个计策，把眼一揉，揉出些泪水来，迎着师父走来。八戒看见，连忙叫：

<八戒> 沙和尚，拿出行李来分了吧！你回流沙河，老猪去高老庄，把白马卖了，买口棺木，给师父送老，大家散伙吧。

<旁白> 唐长老数落八戒说

<唐僧> 正走路，怎么又胡说了？

<旁白> 八戒辩解说

<八戒> 师父，你没看见猴子哭着过来了？他是个钻天入地，斧砍火烧都不怕的好汉，如今泪汪汪地哭来，必是那山险峻，妖怪凶狠。像我们这样软弱的人，怎么去得？

<旁白> 长老道：

<唐僧> “你且休胡谈，待我问他一声，看是怎么说话。”“悟空，有甚话当面计较，你怎么自家烦恼？这般样个哭包脸，是吓唬我也！”

<旁白> 行者说：

<悟空> “师父啊，刚才那个报信的，是日值功曹。他说妖精凶狠，此处难行，果然的山高路峻，不能前进，改日再去罢。”

<旁白> 长老闻言，恐惶悚惧，扯住他虎皮裙子道：

<唐僧> “徒弟呀，我们三停路已走了停半，因何说退悔之言？”

<旁白> 行者道：

<悟空> 师父啊，功曹来报信，说妖怪凶狠，此处难行，我怕魔多力薄，形势孤单，还是改天再去吧

<旁白> 长老说

<悟空> “徒弟啊，你也说得是，果然一个人也难。我这里还有八戒沙僧，都是徒弟，凭你调度使用，或为护将帮手，协力同心，扫清山径，领我过山，却不都还了正果？”

<旁白> 那行者这一场扭捏，就是想让唐长老说出这几句话来，他擦了泪道：

<悟空> “师父啊，若要过得此山，须是猪八戒依得我两件事儿，才有三分去得；假若不依我言，半分儿也莫想过去。”

<旁白> 八戒赶快说道：

<八戒> “啊～师兄不去，就散火罢，不要叫我去。”

<旁白> 长老说道：

<唐僧> “徒弟，且问你师兄，看他教你做甚么。”

<旁白> 呆子真个对行者说道：

<八戒> “哥哥，你教我做甚事？”

<旁白> 行者心中非常高兴，笑首说道：

<悟空> “第一件是看师父，第二件是去巡山。你是选择看师父，还是去巡山?”

<旁白> 八戒一听，顿时不高兴了，说道：

<八戒> “看师父是坐，巡山去是走。终不然教我坐一会又走，走一会又坐，两处怎么顾盼得来？”

<旁白> 行者道

<悟空> “不是教你两件齐干，只是领了一件便罢。”

<旁白> 八戒又笑道：

<悟空> “这等也好说。但是你先说清楚，看师父要做什么，巡山要做什么，你先与我讲讲，等我选一个。”

<旁白> 行者说：

<悟空> “看师父啊：师父去拉粑粑，你擦屁股；

<旁白> 八戒一听，连忙说

<八戒> 什么？他这么大个人了，还不会擦屁股？

<旁白> 悟空接着说，

<悟空> 师父要走路，你背着；

<旁白> 八戒一听，又急了

<八戒> 什么？他这么大个人了，还不会走路？

<旁白> 悟空接着说，

<悟空> 你先别急，师父要吃斋，你还得给他冲奶。

<旁白> 八戒一听，又急了，

<八戒> 还要冲奶？他这么大个人了，还要喝奶？这荒山野岭，我去哪里给他找奶粉给他冲奶？

<旁白> 悟空接着说

<悟空> 师父要是哭了，你还得把他抱起来，摇一摇，哄一哄!

<旁白> 八戒一听，然后睁大眼睛看了看唐僧，说

<八戒> 不是吧，猴哥，他这人都快30岁了，还要抱起来摇一摇，哄一哄？

<旁白> 悟空不慌不忙地说

<悟空> 还有呢，若他饿了些儿，你该打；瘦了些儿脸皮，你该打；

<旁白> 八戒慌了道：

<八戒> “这个难！难！难！拉粑粑擦屁股，抱着摇一摇，哄一哄，通不打紧，就是不离身驮着，也还容易；假若教我去乡下化斋，他这西方路上，不识我是取经的和尚，只道是那山里走出来的一个半壮不壮的肥猪，叫上许多人，把老猪围倒，拿家去做成菜，这个却不就倒霉了？”

<旁白> 行者道：

<悟空> “巡山去罢。”

<旁白> 八戒道：

<八戒> “巡山便怎么样儿？”

<旁白> 行者道：

<悟空> “就入此山，打听有多少妖怪，是甚么山，是甚么洞，我们好过去。”

<旁白> 八戒道：

<八戒> “这个小可，老猪去巡山罢。”

<旁白> 那呆子就撒起衣裙，挺着钉钯，雄纠纠，径入深山；气昂昂，奔上大路。却说那山叫数学山，那山却有一个洞叫几何洞。洞里有两个老妖，一个叫平面妖怪，一个叫立体妖怪。

<旁白> 立体妖怪是大哥，平面妖怪是老二。立体对平面说：

<立体> 兄弟，最近将路过一个唐朝来的和尚，往西方拜佛。听说吃了他的肉，可以延寿长生呢。

<旁白> 平面妖怪说：

<平面> 有这等好事？等我去把他捉来!

<旁白> 立体妖怪说：

<立体> 兄弟，你去捉他，可得小心。我记得他模样，将他师徒画一个像，你拿去，但凡遇着和尚，就用这个照验。

<旁白> 平面妖怪接过画像，径出洞口，往前巡山。

<旁白> 却说唐僧师徒弟这边，八戒要去巡山。行者在旁，忍不住嘻嘻冷笑。长老骂道：

<唐僧> “你这个泼猴！兄弟们全无爱怜之意，常怀嫉妒之心。你做出这样巧言令色，骗他去甚么巡山，却又在这里笑他！”

<旁白> 行者道：

<八戒> “不是笑他，我这笑中有味。你看猪八戒这一去，决不巡山，也不敢见妖怪，不知往那里睡一觉，捏一个谎来，骗我们也。”

<旁白> 长老道：

<唐僧> “你怎么就晓得他？”

<旁白> 行者道：

<悟空> “我估出他是这等，不信，等我跟他去看看，听他一听，一则帮副他手段降妖，二来看他可有个诚心拜佛。”

<旁白> 长老道：

<唐僧> “好好好，你却莫去捉弄他。”

<旁白> 行者应诺了，径直赶上山坡，摇身一变，变作个小虫儿。嘤的一翅飞将去，赶上八戒，钉在他耳朵后面鬃毛底下。

<旁白> 那呆子只管走路，怎知道身上有人，行有七八里路，把钉钯撇下，吊转头来，望着唐僧，指手画脚地骂道：

<八戒> “这和尚，捉弄我的弼马温，不说话的沙和尚！他都在那里自在，捉弄我老猪来巡山！大家取经，都要望成正果，偏是教我来巡甚么山！哈哈哈！

<八戒> 晓得有妖怪，躲着些儿走。不就好了，还要让我去寻找妖怪，这等晦气哩！我往那里睡觉去，睡一觉回去，含含糊糊的答应他，只说是巡了山，也骗他们一骗”

<旁白> 那呆子一时间侥幸，拿着钉钯又走。只见山凹里一弯红草坡，他一头钻得进去，使钉钯扑个地铺，直接的睡下，把腰伸了一伸，道声

<八戒> “快活！就是那弼马温，也不得象我这般自在！”

<旁白> 原来行者在他耳根后，句句儿听着哩，忍不住，飞将起来，又捉弄他一捉弄。又摇身一变，变作个啄木虫儿，但见：铁嘴尖尖红溜，翠翎艳艳光明。一双钢爪利如钉，腹馁何妨林静。最爱枯槎朽烂，偏嫌老树伶仃。

<旁白> 红铜嘴，黑铁脚，刷剌的一翅飞下来。那八戒丢倒头，正睡着了，被他照嘴唇上扢揸的一下。那呆子慌得爬将起来，口里乱嚷道：

<八戒> “有妖怪！有妖怪！把我戳了一枪去了！嘴上好疼呀！”

<旁白> 伸手摸摸，泱出血来了，他道：

<八戒> “蹭蹬啊！我又没甚喜事，怎么嘴上挂了红耶？”

<旁白> 他看着这血手，口里絮絮叨叨的两边乱看，却不见动静，道：

<八戒> “无甚妖怪，怎么戳我一枪么？”

<旁白> 忽抬头往上看时，原来是个啄木虫，在半空中飞哩!八戒说

<八戒> 我晓得了，他一定不认我是个人，只把我鼻子上的两个洞当一段黑朽枯烂的树，内中生了虫，寻虫儿吃的，将我啄了这一下也，等我把嘴藏起来睡罢。”

<旁白>那呆子毂辘的依然睡倒，行者又飞来，着耳根后又啄了一下。八戒跳起来，说

<八戒> 却是什么原因，又跑来啄我的耳朵!我这耳机这么大，却是怎么能藏起来?算了，算了不睡了。

<旁白> 八戒却在地上抓了一把泥，担出唐僧、悟空、沙僧、白龙马。悟空心里想

<悟空> “这猪八戒，他这一去，决不巡山，也不敢见妖怪，难不成还在这里玩过家家？

<旁白> 却见八戒将泥人摆在地下，开始说:

<八戒> 如果师父问我是什么山？我就说数字山，问我什么洞，我就说是叽叽洞，问我里面有什么妖怪，我就说里面有立体妖怪和平面妖怪。

<八戒> 如果问我说平面妖怪上有几种角？我就说有牛角，羊角，鹿角。如果他们问我怎么看哪种角大？我就说我老猪记性差，忘光光了。

<旁白> 那八戒一直在练习，还对着几个泥人有模有样地练习了好几次。行者在旁边看了，心中暗笑。眼看八戒要回去，立马腾两翅预先回去，现原身见了师父.

<旁白> 师父道：

<唐僧> “悟空，你来了，八戒怎不见回？”

<旁白> 行者笑道：

<悟空> “他在那里编谎哩，一会儿就来也。”

<旁白>长老道：

<唐僧> “他两个耳朵盖着眼，一看就是笨笨的人，他会编甚么谎？又是你捏合甚么鬼话骗他哩。”

<旁白> 行者道：

<悟空> “师父，你只是这等护短，这是有对问的话。”

<旁白> 把他那钻在草里睡觉，被啄木虫叮醒，朝石头唱喏，编造甚么数字山、叽叽洞、有妖精的话，预先说了。说毕，不多时，那呆子走将来，又怕忘了那谎，低着头口里温习。被行者喝了一声道：

<悟空> “呆子！念甚么哩？”

<旁白> 八戒掀起耳朵来看看道：

<八戒> “我到了地头了！”

<旁白> 那呆子上前跪倒，长老搀起道：

<唐僧> “徒弟，辛苦啊。”

<旁白> 八戒道：

<八戒> 正是。走路的人，爬山的人，第一辛苦了。

<旁白> 长老道：

<唐僧> 可有妖怪么？

<旁白> 八戒道：

<八戒> 有妖怪！有妖怪！一堆妖怪哩！

<旁白> 八戒说：

<八戒> “他叫我做猪祖宗，猪外公，安排些粉汤素食，教我吃了一顿，说道，摆旗鼓送我们过山哩。”

<旁白> 行者道：

<悟空> “想是在草里睡着了，说得是梦话？”

<旁白> 呆子闻言，就吓得矮了三寸道：

<八戒> 咦，我睡觉他怎么晓得？

<旁白> 行者上前，一把揪住道：

<悟空> “你过来，等我问你。”

<旁白> 呆子又慌了，战战兢兢的道：“问便罢了，为什么要扯我？”

<悟空> “是甚么山？”
<八戒> “是数字山。”
<悟空>“甚么洞？”
<八戒>“是叽叽洞。”
<悟空> “叽叽洞？难道这个洞还会叽叽叫？里面有什么妖怪？”
<八戒> “里面有立体妖怪和平面妖怪。”
<悟空> “立体妖怪和平面妖怪？这两个妖怪，他们都有几个角?”
<八戒> 有牛角，羊角，鹿角。
<悟空> 不消编了，平面上的角，只有锐角，直角，钝角！哪来什么牛角，羊角，鹿角？且再考考你，怎么看角的大小？
<八戒> 我老猪记性差，忘光光了。
<悟空> 如果角的两边越长，这个角就越大？这样对吗？
<八戒> 这个不懂得啊。
<悟空> 角的大小只与他们张开的大小有关，张开得越大，角就越大。跟两边是没有关系的。

<旁白> 八戒说不过，于是只好又重新开始巡山去也。