<旁白> 第二回 几何洞八戒逢灾

<旁白> 话说八戒巡山而去，那妖怪也巡山而来。却听得小妖喊：

<小妖> 那来的甚么人？

<旁白> 呆子才抬起头来，掀着耳朵，看见是些妖魔，他就慌了，心中暗道：

<八戒> “我若说是取经的和尚，他们肯定就把我抓了去，只是说走路的。”

<旁白> 小妖回报道：

<小妖> “大王，是走路的。”

<旁白> 那三十名小怪，中间有认得的，有不认得的，旁边有听着指点说话的，道：

<小妖> 大王，这个过路的，怎么鼻子那么大？跟个大水杯一样

<旁白> 平面妖怪说，

<平面> 难不成有谁一边走路一边喝水？

<小妖> 大王，这个过路的，怎么耳朵那么大？像个大扇子一样

<平面> 难不成有谁一边走路一边扇风？

<小妖> 怎么走路的样子像头猪？

<平面> 这样吧，我问他们几个几何问题，要是能答对，那么就是过路的，要是答错了。那肯定就是猪八戒。

<旁白> 八戒看见，大惊道：

<八戒> 这些妖怪，平时不好好当妖怪，学什么数学、几何，现在好了，问的问题我都回答不上来。

<旁白> 平面妖怪指着八戒大声喊

<平面> 嘿，那个过路的，停一下。问你几个问题。你要是答对了，就把你放过去。要是答错了，那么就把你抓回去腌着吃。

<旁白> 八戒听了，心中暗道：

<八戒> 你可不要问得太难。

<平面> 好，我考考你，你可要听仔细了。

<旁白> 八戒把扇子一样的耳朵拉开，说：

<八戒> 你说啊，我听着呢

<平面> 你看，我这里有三个妖怪，他们脑袋上都有角，你说一说他们都什么角？

<旁白> 这几何中的角，分为锐角、直角、钝角。八戒只能分出动物的角来，哪里分得清楚这些角的种类。他就说：

<八戒> 你们的角，都是妖怪的角。

<小妖> 平面大王，连这么简单的问题都答不上来，这个一定是猪八戒。

<平面> 这三个妖怪头上的角，分别是锐角、直角、钝角。你说一说，哪个角最大？

<旁白> 八戒看了看三个小妖，指着角的两边条最长的那个小妖说，这回肯定对了。

<八戒> 嗯，头上角的两条边最长的那个小妖，头上的那个角最大。

<小妖> 平面大王，这个一定是猪八戒。角的大小，是由两边张开的大小决定的。张开得越大，这个角就越大。怎么能看两条边的长度呢。

<平面> 不要走，你肯定就是八戒。给我拿下他来。

<旁白> 八戒大惊，说：

<八戒> 我现在知道了，角两边张开得越大，这个角也就越大。那现在我可以过路了吗？

<平面> 不行，孩儿们，拿出来我的图像来。我要验一验这个是不是猪八戒。

<旁白> 小妖用枪挑着画，用手指道：

<小妖> “这骑白马的是唐僧，这毛脸的是孙行者。”

<旁白> 八戒听见道：

<小妖> “太好了，没我便也罢了，哦耶!”

<旁白> 口里唠叨，只管许愿。那怪又道：

<小妖> “这黑长的是沙和尚，这长嘴大耳的是猪八戒。”

<旁白> 呆子听见说他的鼻子，慌得把个鼻子揣在怀里藏起来。那怪叫：

<小妖> “和尚，伸出嘴来！让我们大王看看”

<旁白> 八戒哪里肯？

<旁白> 那妖怪让小妖使钩子钩出来。八戒慌得把个嘴伸出道：

<八戒> “你要看便就看，还要拿勾子勾我的鼻子”

<旁白> 平面怪认得是八戒，掣出宝刀，上前就砍。这呆子举钉钯按住道：

<八戒> “我的儿，休无礼！看钉爬！”

<旁白> 那怪笑道：“

<平面> 回答不了问题，就开始耍钉爬了。这个一定是猪八戒。

<旁白> 八戒道：

<八戒> 也别老是你问我，我也问你两个问题。你要是回答不上来，就应该让我过山。你要是回答上来了，我就让你抓回山洞去。

<旁白> 平面妖怪想着自己在平面上最厉害，哪里怕什么猪八戒。他就说：

<平面> 有什么问题，你问吧。我要是回答不上来，就让你过山。我要是回答上来了，就把你抓回山洞去。

<八戒> 我有一个长方形的布,上面画满着一个一个的小正方形格子。长是4个小正形。宽是3个小正形。你说一说，这个能数出多少个正方形。

<旁白> 平面妖怪想了想，说：

<平面> 先有三行，第一行写4和3.第二行写3和2；第三行写2和1；那么总共就是4乘以3，加上，3乘以2，加上，2乘以1，就是12加上6加上2，就是20个正方形。哈哈哈～答对了吧。

<旁白> 八戒却是故意选了个要算一会儿的题目，想趁妖怪在计算的时候，从旁边悄悄逃走，却被一边的小妖发现了。小妖大叫一声：

<小妖> 不好啦，大王，猪八戒想要逃跑啦！

<平面> 你想逃跑？给我拿下他来。

<旁白> 八戒轮起钉爬，卷地打将来。一些小妖怪，还真不是八戒的对手。那平面妖怪见状要上，八戒却说

<八戒> 且慢，我还有一个问题要问你。你想一下，被我打中一下，身上会有几个洞?

<旁白> 平面妖怪想了想，说：

<平面> 被打一下，当然身上有一个洞啦？

<八戒> 笨蛋，我这是钉爬,是九齿钉爬。你被我打中一下，身上会有9个洞。哈哈哈~~

<旁白> 平面妖怪大怒，拿起武器，向八戒砍去。八戒却是早有准备，一边躲闪，一边说：

<八戒> 你猜我师傅有几根头发？

<平面> 人的头发那么多，怎么数得清楚？

<八戒> 哈哈哈，你又错了，我师傅是和尚，和尚的头发是没有的。哈哈哈~~，所以是0根头发。

<旁白> 八戒见平面妖怪回答不出，又问道:

<八戒> 我大师兄也是和尚，请问，他有几根头发？

<平面> 他既然是和尚，那肯定也是光头，当然是0根头发啦

<八戒> 哈～～哈哈～，我师兄是只猴子，头上尽是猴毛，所以是无数根头发。哈哈哈~~

<旁白> 平面妖怪不再啰嗦，拿出一个件宝贝，四四方方，却是一个田字。向八戒说道

<平面> 你看，我这里有一个田字，你说一说，这个田字有几个角？

<旁白> 这八戒只知道耍嘴皮子，哪里知道几何知识，他就说：这么多，怎么数得清楚?

<旁白> 平面妖怪说：

<平面> 这个田字，可以用剪刀剪开，就是4个个小正方形。每个正方形有4个直角，所以四四十六，当然是十六个直角了。

<旁白> 话刚说完，那妖怪拿着宝贝，晃一晃，就跳出来16个小妖怪，每个小妖怪都拿着一件镰刀一样的兵器，向八戒砍去。16个小妖一齐动手。若是一个打一个，其实还好。八戒见那些小妖齐上，慌了手脚，遮架不住，败了阵，回头就跑。原来是道路不平，未曾细看。被其中一个小妖，拿了直角镰刀，绊了个一跤。爬起来正走，又被个小妖，拿着直角镰刀，扳着他脚跟，扑的又跌了个狗吃屎，被一群赶上按住，抓鬃毛，揪耳朵，扯着脚，拉着尾，扛扛抬抬，擒进洞去。

<旁白> 平面妖怪呵呵大知，拿着田字宝贝，再晃一晃，收了16个拿直角镰刀的小妖，捆了八戒、欢欢喜喜欢进了几何洞去。

<旁白> 却说那怪将八戒拿进洞去道：

<平面> “哥哥啊，拿将一个来了。”

<旁白> 老魔喜道：

<立体> “拿来我看。”

<旁白> 平面妖怪说道：

<平面> “这不是？”

<旁白> 老魔道：

<立体> “兄弟，错拿了，这个和尚没用。”

<旁白> 八戒赶快大声说道：

<八戒> “大王，没用的和尚，放他出去吧”

<旁白> 二魔道：

<平面> “哥哥，不要放他，虽然没用，也是唐僧一起的，叫做猪八戒。把他且浸在后边净水池中，浸退了毛衣，使盐腌着，晒干了，等天阴下酒。”

<旁白>八戒听言道：

<八戒> “运气真差啊！撞着个喜欢腌腊肉的妖怪了！”

<旁白> 那小妖把八戒抬进去，抛在水里不题。却说三藏坐在坡前，耳热眼跳，身体不安，叫声：

<唐僧> “悟空！怎么悟能这番巡山，去这么久还不回来？”

<悟空> “师父还不晓得他的心哩。师父莫虑，且请上马。那呆子有些懒惰，断然走的迟慢。你把马打动些儿，我们定赶上他，一同去罢。”

<旁白> 真个唐僧上马，沙僧挑担，行者前面引路上山。

<旁白> 却说那立体妖怪又唤平面妖怪道：

<立体> “兄弟，你既拿了八戒，断乎就有唐僧。再去巡巡山来，切莫放过他去。”

<平面> “就行，就行。”

<旁白> 你看他急点起五十名小妖，上山巡逻。正走处，只见祥云缥缈，瑞气盘旋，平面妖怪道：

<平面> “唐僧来了。”

<旁白> 众妖道：

<小妖> “唐僧在那里？”

<平面>“好人头上祥云照顶，恶人头上黑气冲天。那唐僧原是金蝉长老临凡，十世修行的好人，所以有这样云缥缈。”

<旁白> 众怪都不看见，平面妖怪用手指道：

<平面> “那不是？”

<旁白>那三藏就在马上打了一个寒噤，又一指，又打个寒噤。一连指了三指，他就一连打了三个寒噤，心神不宁道：

<唐僧> “徒弟啊，我怎么打寒噤么？”

<沙僧> 沙僧道：“打寒战肯定是感冒了

<旁白> 行者道：

<悟空> “胡说，师父是走着这深山峻岭，必然小心虚惊。莫怕！莫怕！等老孙把棒打一路与你压压惊。”

<旁白> 好行者，理开棒，在马前丢几个解数，上三下四，左五右六，尽按那六韬三略，使起神通。那长老在马上观之，真个是寰中少有，世上全无。剖开路一直前行，险些儿不唬倒那怪物。

<旁白>平面妖怪在山顶上看见，魂飞魄丧，忽失声道：

<平面> “几年间闻说孙行者，今日才知话不虚传果是真。”

<旁白> 众怪上前道：

<小妖> “大王，怎么长他人之志气，灭自己之威风？你夸谁哩？”

<旁白>二魔道：

<平面> “孙行者神通广大，那唐僧吃他不成。”

<旁白> 众怪道：

<小妖> “大王，你没手段，等我们着几个去报大大王，教他点起本洞大小兵来，摆开阵势，合力齐心，怕他走了那里去！”

<平面> “你们不曾见他那条铁棒，有万夫不当之勇，我洞中不过有四五百兵，怎禁得他那一棒？”

<小妖> “这等说，唐僧吃不成，却不把猪八戒错拿了？如今送还他罢。”

<平面> “拿便也不曾错拿，送便也不好轻送。唐僧终是要吃，只是眼下还尚不能。”

<小妖> “这般说，还过几年么？”

<平面> 让我想个好办法抓住悟空和唐僧!

<小妖> “大王想了个什么办法？需要用到我们吗？”

<平面> “你们都回山洞，但不许报与大王知道。若是惊动了他，必然走了风声，坏了我的办法。我自有个神通变化，可以拿他。”

<旁白> 众妖散去，他独跳下山来，在那道路之旁，摇身一变，变做个年老的道者，真个是怎生打扮？他在那大路旁妆做个跌折腿的道士，脚上血淋津，口里哼哼的，只叫

<平面> “救人！救人！”

<旁白> 却说这三藏仗着孙大圣与沙僧，欢喜前来，正行处，只听得叫

<平面> “师父救人！”

<旁白> 三藏闻得道：

<唐僧> “善哉！善哉！这旷野山中，四下里更无村舍，是甚么人叫？想必是虎豹狼虫唬倒的。”

<旁白> 这长老兜回俊马，叫道：

<唐僧> “那有难者是甚人？可出来。”

<旁白> 这怪从草科里爬出，对长老马前，乒乓的只情磕头。三藏在马上见他是个道者，却又年纪高大，甚不过意，连忙下马搀道：

<唐僧> “请起，请起。”

<旁白> 那怪道：

<平面> “疼！疼！疼！”

丢了手看处，只见他脚上流血，三藏惊问道：


<唐僧> “先生啊，你从那里来？因甚伤了尊足？”

那怪巧语花言，虚情假意道：

<平面> “师父啊，此山西去，有一座清幽观宇，我是那观里的道士。”
<唐僧> “你不在本观中侍奉香火，演习经法，为何在此闲行？”
<平面> “因前日山南里施主家，邀道众禳星，散福来晚，我师徒二人，一路而行。行至深衢，忽遇着一只斑斓猛虎，将我徒弟衔去，贫道战兢兢亡命走，一跤跌在乱石坡上，伤了腿足，不知回路。今日大有天缘，得遇师父，万望师父大发慈悲，救我一命。若得到观中，就是典身卖命，一定重谢深恩。”

三藏闻言，认为真实，道：

<唐僧> “先生啊，你我都是一命之人，我是僧，你是道，衣冠虽别，修行之理则同。我不救你啊，就不是出家之辈。救便救你，你却走不得路哩。”

<平面> “立也立不起来，怎生走路？”
<唐僧> “也罢，也罢。我还走得路，将马让与你骑一程，到你上宫，还我马去罢。”
<平面> “师父，感蒙厚情，只是腿胯跌伤，不能骑马。”
<唐僧> “正是。”
叫沙和尚：

<唐僧>“你把行李捎在我马上，你驮他一程罢。”

沙僧道：

<沙僧> “我驮他。”

那怪急回头，抹了他一眼道：

<平面> “师父啊，我被那猛虎唬怕了，这个什么沙和尚，胡子那么长，那么多，看起来就那么凶，愈加惊怕，不敢要他驮。”

三藏叫道：

<唐僧> “悟空，你驮罢。”

行者连声答应道：

<W> “我驮我驮！”

那妖就认定了行者，顺顺的要他驮，再不言语。沙僧笑道：

<S> “这个没眼色的老道！我驮着不好，颠倒要悟空驮。这猴子若看不见师父时，三尖石上，把筋都摔断了你的哩！”

行者驮了，口中笑道：

<W> “你这个泼魔，怎么敢来惹我？你也问问老孙是几年的人儿！你这般鬼话儿，只好瞒唐僧，又好来瞒我？我认得你是这山中的怪物，想是要吃我师父哩。我师父又非是等闲之辈，是你吃的！你要吃他，也须是分多一半与老孙是。”

那魔闻得行者口中念诵，道：

<P> “师父，我是好人家儿孙，做了道士。 今日不幸，遇着虎狼之厄，我不是妖怪。”

行者道：

<W> “你既怕虎狼，怎么不念《北斗经》？”

三藏正然上马，闻得此言，骂道：

<T> “这个泼猴！救人一命，胜造七级浮屠。你驮他驮儿便罢了，且讲甚么北斗经南斗经！”

行者闻言道：

<W> “这厮造化哩！我那师父是个慈悲好善之人，又有些外好里枒槎。我待不驮你，他就怪我。驮便驮，须要与你说好：如果要拉粑粑，千万要和我说。一定不能拉在我背上！

<P> 我知道，我知道，我这个道士这么大年纪了，难道这个还不清楚?

<W> 对了，如果要把嘘嘘，也千万要和我说，别尿在我背上!

<P>“我这般一把子年纪，岂不知你的话说？”

行者才拉道士起来，背在身上，同长老、沙僧，奔大路西行。那山上高低不平之处，行者留心慢走，让唐僧前去。行不上三五里路，师父与沙僧下了山凹之中，行者却望不见，心中埋怨道：

<W> “师父这么大年纪，却这么不懂事。路这么远，又这么难走，就算是空着手，走起来也费劲。却还要让我背着个妖怪。你难道不知道这个妖怪要吃你吗？

这大圣正要想把妖怪摔死在山上。原来那怪就知道了，就使一个法术，就在行者背上捻诀，念动真言。
把一座须弥山遣在空中，劈头准备来压行者。平面妖怪想了一个办法，问道：

<P> 我且问你一个问题，你要是回答不上来，这须弥山可就压你身上了啊？

悟空笑着说

<W> 我又不是八戒那么蠢笨，你怎么考得倒我？

<P> 时钟上几点的时候，分钟和时钟会成为直角？

<W> 当然是3时和9时。

平面妖怪大声笑道

<P> 你可答错了，3时和9时虽然是直角。但是还有15时和21时。也就是下午3时和晚上9时。这个时候也是直角。所以一共是4个时间。哈哈哈

悟空却是不怕，笑道：

<W> “我的儿，你使甚么重身法来压老孙哩？这个倒也不怕，只是正担好挑，偏担儿难挨。”

那魔道：

<P> “一座山压他不住！”

却又念咒语，把一座峨眉山遣在空中来压。平面妖怪却说：

<P> 我且问你一个问题，你要是回答不上来，这峨眉山可就压你身上了啊？

<W> 你快点问

<P> 我和9个妖怪去吃饼，每个人吃了9个，请问一共吃了多少个饼？

<W> 九九八十一，当然是八十一个饼了。

<P> 哈哈哈，你又错了。“题目问的是，我和9个妖怪”，当然是10个人啦。每个人吃9个饼，当然应该就是90个饼。哈哈哈，看山!

妖怪把峨眉山往下一压。行者又把头偏一偏，压在右肩背上。看他挑着两座大山，飞星来赶师父！那魔头看见，就吓得浑身是汗：

<P> “他却会担山！”

又整性情，把真言念动，将一座泰山遣在空中，劈头要来压行者。

<P> 我再问你一个问题，要是回答出错，这压可就压下来了哈!

<W> 还有什么问题，快快问来。

<P> 我有一个长方形纸，什么都不做的时候，有1个长方形。现在我折一下，有几个小长方形？

<W> 当然是2个。

<P> 那我折2次，有几个小长方形？

<W> 那当然是4个小长方形啦。

<P> 那我折了6次，一共有多少个小长方形？

悟空却一时回想不起，那平面妖怪立刻把泰山往下一压。悟空遭逢他这泰山下顶之法，只压得三尸神咋，七窍喷红。

好妖魔，使神通压倒行者，却疾驾长风，去赶唐三藏，就于云端里伸下手来，马上挝人。慌得个沙僧丢了行李，掣出降妖棒，当头挡住。那妖魔举一口七星剑，对面来迎。这一场好杀：

那魔十分凶猛，使口宝剑，流星的解数滚来，把个沙僧战得软弱难搪。妖怪说道，

<P> 要是回答出这个问题，我就放了你这沙和尚，快与你大师兄报个信去。要是回答不出，立马将你抓回山洞里去。

<S> 你要问便问。

<P> 我有4个妖怪，1号妖怪头尖尖，便是个锐角。2号妖怪头拐弯，便是个直角。3号妖怪头钝钝，便是个钝角。4号妖怪头圆圆，便是个圆形。请问带角的分别是几号妖怪。

那沙和尚，想来想去。便道1号和2号分别是锐角妖怪，却忘了直角也属于角。但说

<S> 带角的是1号和2号，一共有两个妖怪头上有角。

<P> 哈哈哈，这么简单都答错。跟我去山洞去吧。

沙和尚回头要走，早被他逼住宝杖，轮开大手，挝住沙僧，挟在左胁下，将右手去马上拿了三藏，脚尖儿钩着行李，张开口，咬着马鬃，使起摄法，把他们一阵风，都拿到莲花洞里，厉声高叫道：

<P> “哥哥！这和尚都拿来了！”

老魔闻言大喜道：

<L> “拿来我看。”

二魔道：

<P> “这不是？”

老魔道：

<L> “贤弟呀，又错拿来了也。”

二魔道：

<P> “你说拿唐僧的。”

老魔道：

<L> “是便就是唐僧，只是还不曾拿住那有手段的孙行者。须是拿住他，才好吃唐僧哩。若不曾拿得他，切莫动他的人。那猴王神通广大，变化多般，我们若吃了他师父，他肯甘心？来那门前吵闹，莫想能得安生。”

二魔笑道：

<P> “哥啊，你也忒会抬举人。若依你夸奖他，天上少有，地下全无，自我观之，也只如此，没甚手段。”

老魔道：

<L> “你拿住了？”

二魔道：

<P> “他已被我遣三座大山压在山下，寸步不能举移，所以才把唐僧、沙和尚连马行李，都摄将来也。”

那老魔闻言满心欢喜道：

<L> “造化！造化！拿住这厮，唐僧才是我们口里的食哩。”

叫小妖：

<L> “快安排酒来，且与你二大王奉一个得功的杯儿。”

二魔道：

<P> “哥哥，且不要吃酒，叫小的们把猪八戒捞上水来吊起。”

遂把八戒吊在东廊，沙僧吊在西边，唐僧吊在中间，白马送在槽上，行李收将进去。

老魔笑道：

<L> “贤弟好手段！两次捉了三个和尚。但孙行者虽是有山压住，也须要作个法，怎么拿他来凑蒸才好哩。”

二魔道：

<P> “兄长请坐。若要拿孙行者，不消我们动身，只教两个小妖，拿两件宝贝，把他装将来罢。”

老魔道：

<L> “拿什么宝贝去? 

毕竟不知怎生区处，且听下回分解。

